use leptos::prelude::*;
use rand::seq::SliceRandom;

const QUESTIONS: [&str; 50] = [
    "평생 한 가지만 먹어야 한다면 뭐 먹을래요?",
    "갑자기 투명인간이 된다면 제일 먼저 뭐 할 건가요?",
    "하루 동안 동물로 변할 수 있다면 어떤 동물?",
    "본인 인생에서 가장 어이없었던 실수는?",
    "복권 1등 되면 제일 먼저 누구에게 말할 건가요?",
    "절대 못 먹는 음식 하나만 고른다면?",
    "좀비 아포칼립스가 오면 제일 먼저 챙길 물건은?",
    "지금까지 들어본 별명 중 가장 웃겼던 건?",
    "본인이 생각하는 “나의 TMI” 하나 공개한다면?",
    "무인도에 가면 꼭 데려가고 싶은 사람은?",
    "커피 vs 차?",
    "여름 vs 겨울?",
    "집콕 vs 밖에서 놀기?",
    "아침형 인간 vs 야행성?",
    "단짠단짠 vs 담백?",
    "넷플릭스 정주행 vs 유튜브 알고리즘?",
    "계획형 여행 vs 즉흥 여행?",
    "혼밥 잘함 vs 혼밥 어려움?",
    "전화 vs 문자?",
    "강아지 vs 고양이?",
    "인생 영화 하나만 고른다면?",
    "타임머신이 있다면 과거 vs 미래?",
    "갑자기 10억 생기면 뭐부터 할까요?",
    "다시 태어나면 꼭 해보고 싶은 직업은?",
    "나를 가장 잘 설명하는 영화/드라마 캐릭터는?",
    "평생 한 노래만 들어야 한다면?",
    "스트레스 받을 때 나만의 해소법은?",
    "꼭 한 번 가보고 싶은 나라/도시는?",
    "지금 당장 휴가 준다면 뭐 하고 싶어요?",
    "요즘 가장 빠져 있는 소소한 취미는?",
    "최근에 제일 많이 웃었던 순간은?",
    "요즘 가장 감사한 일 하나는?",
    "나만의 소확행(소소하지만 확실한 행복)은?",
    "최근에 도전해본 새로운 게 있다면?",
    "어린 시절 꿈은 뭐였어요?",
    "하루 중 제일 좋아하는 시간대는?",
    "요즘 나를 가장 설레게 하는 건?",
    "다시 꼭 해보고 싶은 학창시절 활동은?",
    "최근에 “아, 나 어른 됐구나” 느낀 순간은?",
    "오늘 이 자리에서 꼭 얻어가고 싶은 게 있다면?",
    "두 사람이 물에 빠졌습니다. 누구를 구할까요? 1. 카리나, 2. 재승님",
    "팀에서 제일 일을 많이 하는것 같은 사람은?",
    "첫인상과 실제 성격이 정반대였던 사람이 있나요? (회사에서)",
    "오피스에 '이건 정말 있었으면 좋겠다' 라고 생각하는 것이 있다면?",
    "팀원들 중 한명에게 두쫀쿠를 준다면 누구에게 줄까요?",
    "무인도에서 살아남을 확률이 가장 높을것 같은 팀원은 누구인가요?",
    "제일 술을 잘 먹을것 같은 팀원은 누구인가요?",
    "과거로 돌아갈 수 있다면 다시 LINE Pay Plus에 입사하실 건가요?",
    "노래를 제일 잘 부를것 같은 사람을 골라주세요.",
    "LINE Pay Plus 최고 꽃미남은 누구인가요?",
];

const WELCOME: &str = "😄";

#[component]
fn App() -> impl IntoView {
    let (pool, set_pool) = signal(Vec::from(QUESTIONS));
    let (question, set_question) = signal(WELCOME);

    let mut rng = rand::rng();

    set_pool.update(|pool| {
        pool.shuffle(&mut rng);
    });

    let next_question = move |_| {
        set_pool.update(|p| {
            let result = p.pop();
            if let Some(next_question) = result {
                set_question.set(next_question);
            } else {
                set_question.set("질문이 소진되었습니다!");
            }
        });
    };

    let reset_questions = move |_| {
        set_pool.update(|pool| {
            *pool = Vec::from(QUESTIONS);
            pool.shuffle(&mut rng);
        });
        set_question.set(WELCOME);
    };

    view! {
        <div class="layout">
            <h1>무작위 질문 생성기</h1>
            <div class="layout_inner">
                <aside>"남은 질문: " {move || pool.get().len()} " 개"</aside>
                <p>{question}</p>
                <button on:click=next_question>
                    다음 질문
                </button>
                <button on:click=reset_questions>
                    질문 초기화
                </button>
            </div>
        </div>
    }
}

fn main() {
    leptos::mount::mount_to_body(App);
}
